tests/phpunit/CRM/WeAct/Action/proca-messages/stripe-monthly-payment.json

{
    "id": "evt_1KeMNNLEJyfuWvBBfhsL2KoU",
    "object": "event",
    "api_version": "2020-03-02",
    "created": 1647535237,
    "data": {
        "object": {
            "id": "in_1KeMNKLEJyfuWvBBONsQleKJ",
            "object": "invoice",
            "account_country": "DE",
            "account_name": "WeMove Europe SCE mbH",
            "account_tax_ids": null,
            "amount_due": 400,
            "amount_paid": 400,
            "amount_remaining": 0,
            "application_fee_amount": null,
            "attempt_count": 1,
            "attempted": true,
            "auto_advance": false,
            "automatic_tax": {
                "enabled": false,
                "status": null
            },
            "billing_reason": "subscription_update",
            "charge": "ch_3KeMNLLEJyfuWvBB0sCGqSlI",
            "collection_method": "charge_automatically",
            "created": 1647535234,
            "currency": "eur",
            "custom_fields": null,
            "customer": "cus_LJpO02o5iv5ONs",
            "customer_address": {
                "city": null,
                "country": "",
                "line1": null,
                "line2": null,
                "postal_code": null,
                "state": null
            },
            "customer_email": null,
            "customer_name": "Gay undefined",
            "customer_phone": null,
            "customer_shipping": null,
            "customer_tax_exempt": "none",
            "customer_tax_ids": [],
            "default_payment_method": null,
            "default_source": null,
            "default_tax_rates": [],
            "description": null,
            "discount": null,
            "discounts": [],
            "due_date": null,
            "ending_balance": 0,
            "footer": null,
            "hosted_invoice_url": "https://invoice.stripe.com/i/acct_16ExxKLEJyfuWvBB/test_YWNjdF8xNkV4eEtMRUp5ZnVXdkJCLF9MTDJTclhlWEVST1dlcHRPQkJoMlUzYVdyWExFMWF5LDM4MDc2MDM30200FQlkEyH2?s=ap",
            "invoice_pdf": "https://pay.stripe.com/invoice/acct_16ExxKLEJyfuWvBB/test_YWNjdF8xNkV4eEtMRUp5ZnVXdkJCLF9MTDJTclhlWEVST1dlcHRPQkJoMlUzYVdyWExFMWF5LDM4MDc2MDM30200FQlkEyH2/pdf?s=ap",
            "last_finalization_error": null,
            "lines": {
                "object": "list",
                "data": [
                    {
                        "id": "il_1KeMNKLEJyfuWvBBUQ5CpGQO",
                        "object": "line_item",
                        "amount": 400,
                        "currency": "eur",
                        "description": "1 × WeMove Donation (at €4.00 / month)",
                        "discount_amounts": [],
                        "discountable": true,
                        "discounts": [],
                        "livemode": false,
                        "metadata": {},
                        "period": {
                            "end": 1650213634,
                            "start": 1647535234
                        },
                        "plan": {
                            "id": "price_1KdBjXLEJyfuWvBB0IGwvYP3",
                            "object": "plan",
                            "active": false,
                            "aggregate_usage": null,
                            "amount": 400,
                            "amount_decimal": "400",
                            "billing_scheme": "per_unit",
                            "created": 1647255999,
                            "currency": "eur",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_JjiIPD7pifRJMk",
                            "tiers": null,
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "price": {
                            "id": "price_1KdBjXLEJyfuWvBB0IGwvYP3",
                            "object": "price",
                            "active": false,
                            "billing_scheme": "per_unit",
                            "created": 1647255999,
                            "currency": "eur",
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_JjiIPD7pifRJMk",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "month",
                                "interval_count": 1,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "tax_behavior": "unspecified",
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": 400,
                            "unit_amount_decimal": "400"
                        },
                        "proration": false,
                        "proration_details": {
                            "credited_items": null
                        },
                        "quantity": 1,
                        "subscription": "sub_1KdBjXLEJyfuWvBBStR9MJFk",
                        "subscription_item": "si_LJpO5ZLeuaSh6s",
                        "tax_amounts": [],
                        "tax_rates": [],
                        "type": "subscription"
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/invoices/in_1KeMNKLEJyfuWvBBONsQleKJ/lines"
            },
            "livemode": false,
            "metadata": {},
            "next_payment_attempt": null,
            "number": "0792A9BD-0003",
            "on_behalf_of": null,
            "paid": true,
            "paid_out_of_band": false,
            "payment_intent": "pi_3KeMNLLEJyfuWvBB006Ql1pO",
            "payment_settings": {
                "payment_method_options": null,
                "payment_method_types": null
            },
            "period_end": 1647535234,
            "period_start": 1647535234,
            "post_payment_credit_notes_amount": 0,
            "pre_payment_credit_notes_amount": 0,
            "quote": null,
            "receipt_number": null,
            "starting_balance": 0,
            "statement_descriptor": null,
            "status": "paid",
            "status_transitions": {
                "finalized_at": 1647535234,
                "marked_uncollectible_at": null,
                "paid_at": 1647535234,
                "voided_at": null
            },
            "subscription": "sub_1KdBjXLEJyfuWvBBStR9MJFk",
            "subtotal": 400,
            "tax": null,
            "tax_percent": null,
            "test_clock": null,
            "total": 400,
            "total_discount_amounts": [],
            "total_tax_amounts": [],
            "transfer_data": null,
            "webhooks_delivered_at": 1647535234
        }
    },
    "livemode": false,
    "pending_webhooks": 1,
    "request": {
        "id": "req_0qSUICTikqhq9X",
        "idempotency_key": "98bf6647-cc95-4e24-bb12-07b9dbfc250e"
    },
    "type": "invoice.payment_succeeded"
}