tests/phpunit/CRM/WeAct/Action/proca-messages/stripe-monthly.json

{
    "action": {
        "actionType": "donate",
        "createdAt": "2022-03-14T11:06:44Z",
        "customFields": {
            "amount": 4,
            "campaign": 1339,
            "frequency": "monthly",
            "initialAmount": 8,
            "language": "en",
            "paymentMethod": "stripe",
            "speakoutCampaign": 1339
        },
        "donation": {
            "amount": 400,
            "currency": "EUR",
            "frequencyUnit": "monthly",
            "payload": {
                "customerId": "cus_LJpO02o5iv5ONs",
                "formValues": {
                    "country": "PL",
                    "email": "aaronelliotross+wifezit@gmail.com",
                    "firstname": "Gay",
                    "lastname": "Emerson",
                    "postcode": "88 LL CC"
                },
                "paymentConfirm": {
                    "amount": 400,
                    "automatic_payment_methods": null,
                    "canceled_at": null,
                    "cancellation_reason": null,
                    "capture_method": "automatic",
                    "client_secret": "pi_3KdBjYLEJyfuWvBB0FUFhqtj_secret_kFoGN21NEGxTsdFwxwwhZNgu4",
                    "confirmation_method": "automatic",
                    "created": 1647256000,
                    "currency": "eur",
                    "description": "Subscription creation",
                    "id": "pi_3KdBjYLEJyfuWvBB0FUFhqtj",
                    "last_payment_error": null,
                    "livemode": false,
                    "next_action": null,
                    "object": "payment_intent",
                    "payment_method": "pm_1KdBjZLEJyfuWvBBX2nAjkBo",
                    "payment_method_types": [
                        "card",
                        "sepa_debit"
                    ],
                    "processing": null,
                    "receipt_email": null,
                    "setup_future_usage": "off_session",
                    "shipping": null,
                    "source": null,
                    "status": "succeeded"
                },
                "paymentIntent": {
                    "client_secret": "pi_3KdBjYLEJyfuWvBB0FUFhqtj_secret_kFoGN21NEGxTsdFwxwwhZNgu4",
                    "response": {
                        "application_fee_percent": null,
                        "livemode": false,
                        "collection_method": "charge_automatically",
                        "default_payment_method": null,
                        "tax_percent": null,
                        "metadata": {},
                        "pending_setup_intent": null,
                        "discount": null,
                        "start_date": 1647255999,
                        "pause_collection": null,
                        "customer": "cus_LJpO02o5iv5ONs",
                        "ended_at": null,
                        "days_until_due": null,
                        "pending_invoice_item_interval": null,
                        "billing_thresholds": null,
                        "next_pending_invoice_item_invoice": null,
                        "default_source": null,
                        "cancel_at_period_end": false,
                        "object": "subscription",
                        "billing_cycle_anchor": 1647255999,
                        "schedule": null,
                        "canceled_at": null,
                        "current_period_end": 1649934399,
                        "latest_invoice": {
                            "customer_tax_exempt": "none",
                            "auto_advance": false,
                            "customer_phone": null,
                            "invoice_pdf": "https://pay.stripe.com/invoice/acct_16ExxKLEJyfuWvBB/test_YWNjdF8xNkV4eEtMRUp5ZnVXdkJCLF9MSnBPSEJ1T0h0ZjBzdlBFbjF4V2F5czd6T1dQWjVFLDM3Nzk2ODAw0200le7SLCtw/pdf?s=ap",
                            "starting_balance": 0,
                            "livemode": false,
                            "customer_tax_ids": [],
                            "collection_method": "charge_automatically",
                            "default_payment_method": null,
                            "amount_due": 400,
                            "attempt_count": 0,
                            "customer_name": "Gay undefined",
                            "custom_fields": null,
                            "tax_percent": null,
                            "subtotal": 400,
                            "account_country": "DE",
                            "metadata": {},
                            "description": null,
                            "paid": false,
                            "pre_payment_credit_notes_amount": 0,
                            "subscription_proration_date": null,
                            "footer": null,
                            "customer_shipping": null,
                            "total": 400,
                            "payment_intent": {
                                "setup_future_usage": "off_session",
                                "payment_method": null,
                                "livemode": false,
                                "capture_method": "automatic",
                                "payment_method_options": {
                                    "card": {
                                        "installments": null,
                                        "mandate_options": null,
                                        "network": null,
                                        "request_three_d_secure": "automatic"
                                    },
                                    "sepa_debit": {}
                                },
                                "charges": {
                                    "data": [],
                                    "has_more": false,
                                    "object": "list",
                                    "total_count": 0,
                                    "url": "/v1/charges?payment_intent=pi_3KdBjYLEJyfuWvBB0FUFhqtj"
                                },
                                "amount_received": 0,
                                "metadata": {},
                                "description": "Subscription creation",
                                "payment_method_types": [
                                    "card",
                                    "sepa_debit"
                                ],
                                "amount_capturable": 0,
                                "review": null,
                                "confirmation_method": "automatic",
                                "next_action": null,
                                "on_behalf_of": null,
                                "customer": "cus_LJpO02o5iv5ONs",
                                "amount": 400,
                                "invoice": "in_1KdBjYLEJyfuWvBBbaVLe2g6",
                                "statement_descriptor": "WeMove Europe",
                                "application": null,
                                "client_secret": "pi_3KdBjYLEJyfuWvBB0FUFhqtj_secret_kFoGN21NEGxTsdFwxwwhZNgu4",
                                "receipt_email": null,
                                "object": "payment_intent",
                                "source": null,
                                "last_payment_error": null,
                                "canceled_at": null,
                                "currency": "eur",
                                "created": 1647256000,
                                "cancellation_reason": null,
                                "status": "requires_payment_method",
                                "transfer_group": null,
                                "application_fee_amount": null,
                                "statement_descriptor_suffix": null,
                                "transfer_data": null,
                                "id": "pi_3KdBjYLEJyfuWvBB0FUFhqtj",
                                "shipping": null
                            },
                            "threshold_reason": null,
                            "discount": null,
                            "customer_email": null,
                            "charge": null,
                            "account_name": "WeMove Europe SCE mbH",
                            "customer": "cus_LJpO02o5iv5ONs",
                            "amount_paid": 0,
                            "hosted_invoice_url": "https://invoice.stripe.com/i/acct_16ExxKLEJyfuWvBB/test_YWNjdF8xNkV4eEtMRUp5ZnVXdkJCLF9MSnBPSEJ1T0h0ZjBzdlBFbjF4V2F5czd6T1dQWjVFLDM3Nzk2ODAw0200le7SLCtw?s=ap",
                            "statement_descriptor": null,
                            "due_date": null,
                            "default_source": null,
                            "receipt_number": null,
                            "billing_reason": "subscription_create",
                            "object": "invoice",
                            "status_transitions": {
                                "finalized_at": 1647256000,
                                "marked_uncollectible_at": null,
                                "paid_at": null,
                                "voided_at": null
                            },
                            "post_payment_credit_notes_amount": 0,
                            "currency": "eur",
                            "created": 1647256000,
                            "amount_remaining": 400,
                            "period_end": 1647255999,
                            "next_payment_attempt": null,
                            "subscription": "sub_1KdBjXLEJyfuWvBBStR9MJFk",
                            "webhooks_delivered_at": 1647256000,
                            "total_tax_amounts": [],
                            "deleted": null,
                            "status": "open",
                            "ending_balance": 0,
                            "customer_address": {
                                "city": null,
                                "country": "",
                                "line1": null,
                                "line2": null,
                                "postal_code": null,
                                "state": null
                            },
                            "number": "0792A9BD-0001",
                            "application_fee_amount": null,
                            "tax": null,
                            "period_start": 1647255999,
                            "attempted": false,
                            "id": "in_1KdBjYLEJyfuWvBBbaVLe2g6",
                            "default_tax_rates": [],
                            "lines": {
                                "data": [
                                    {
                                        "amount": 400,
                                        "currency": "eur",
                                        "description": "1 × WeMove Donation (at €4.00 / month)",
                                        "discountable": true,
                                        "id": "il_1KdBjYLEJyfuWvBBfKsMulq9",
                                        "invoice_item": null,
                                        "livemode": false,
                                        "metadata": {},
                                        "object": "line_item",
                                        "period": {
                                            "end": 1649934399,
                                            "start": 1647255999
                                        },
                                        "plan": {
                                            "active": false,
                                            "aggregate_usage": null,
                                            "amount": 400,
                                            "amount_decimal": "400",
                                            "billing_scheme": "per_unit",
                                            "created": 1647255999,
                                            "currency": "eur",
                                            "deleted": null,
                                            "id": "price_1KdBjXLEJyfuWvBB0IGwvYP3",
                                            "interval": "month",
                                            "interval_count": 1,
                                            "livemode": false,
                                            "metadata": {},
                                            "name": null,
                                            "nickname": null,
                                            "object": "plan",
                                            "product": "prod_JjiIPD7pifRJMk",
                                            "tiers": null,
                                            "tiers_mode": null,
                                            "transform_usage": null,
                                            "trial_period_days": null,
                                            "usage_type": "licensed"
                                        },
                                        "price": {
                                            "active": false,
                                            "amount_decimal": null,
                                            "billing_scheme": "per_unit",
                                            "created": 1647255999,
                                            "currency": "eur",
                                            "id": "price_1KdBjXLEJyfuWvBB0IGwvYP3",
                                            "livemode": false,
                                            "lookup_key": null,
                                            "metadata": {},
                                            "nickname": null,
                                            "object": "price",
                                            "product": "prod_JjiIPD7pifRJMk",
                                            "recurring": {
                                                "aggregate_usage": null,
                                                "interval": "month",
                                                "interval_count": 1,
                                                "trial_period_days": null,
                                                "usage_type": "licensed"
                                            },
                                            "tiers": null,
                                            "tiers_mode": null,
                                            "transform_quantity": null,
                                            "type": "recurring",
                                            "unit_amount": 400
                                        },
                                        "proration": false,
                                        "quantity": 1,
                                        "subscription": "sub_1KdBjXLEJyfuWvBBStR9MJFk",
                                        "subscription_item": "si_LJpO5ZLeuaSh6s",
                                        "tax_amounts": [],
                                        "tax_rates": [],
                                        "type": "subscription"
                                    }
                                ],
                                "has_more": false,
                                "object": "list",
                                "total_count": 1,
                                "url": "/v1/invoices/in_1KdBjYLEJyfuWvBBbaVLe2g6/lines"
                            }
                        },
                        "created": 1647255999,
                        "trial_end": null,
                        "cancel_at": null,
                        "trial_start": null,
                        "collection_method_thresholds": null,
                        "current_period_start": 1647255999,
                        "quantity": 1,
                        "status": "incomplete",
                        "items": {
                            "data": [
                                {
                                    "billing_thresholds": null,
                                    "created": 1647256000,
                                    "deleted": null,
                                    "id": "si_LJpO5ZLeuaSh6s",
                                    "metadata": {},
                                    "object": "subscription_item",
                                    "plan": {
                                        "active": false,
                                        "aggregate_usage": null,
                                        "amount": 400,
                                        "amount_decimal": "400",
                                        "billing_scheme": "per_unit",
                                        "created": 1647255999,
                                        "currency": "eur",
                                        "deleted": null,
                                        "id": "price_1KdBjXLEJyfuWvBB0IGwvYP3",
                                        "interval": "month",
                                        "interval_count": 1,
                                        "livemode": false,
                                        "metadata": {},
                                        "name": null,
                                        "nickname": null,
                                        "object": "plan",
                                        "product": "prod_JjiIPD7pifRJMk",
                                        "tiers": null,
                                        "tiers_mode": null,
                                        "transform_usage": null,
                                        "trial_period_days": null,
                                        "usage_type": "licensed"
                                    },
                                    "price": {
                                        "active": false,
                                        "amount_decimal": null,
                                        "billing_scheme": "per_unit",
                                        "created": 1647255999,
                                        "currency": "eur",
                                        "id": "price_1KdBjXLEJyfuWvBB0IGwvYP3",
                                        "livemode": false,
                                        "lookup_key": null,
                                        "metadata": {},
                                        "nickname": null,
                                        "object": "price",
                                        "product": "prod_JjiIPD7pifRJMk",
                                        "recurring": {
                                            "aggregate_usage": null,
                                            "interval": "month",
                                            "interval_count": 1,
                                            "trial_period_days": null,
                                            "usage_type": "licensed"
                                        },
                                        "tiers": null,
                                        "tiers_mode": null,
                                        "transform_quantity": null,
                                        "type": "recurring",
                                        "unit_amount": 400
                                    },
                                    "quantity": 1,
                                    "subscription": "sub_1KdBjXLEJyfuWvBBStR9MJFk",
                                    "tax_rates": []
                                }
                            ],
                            "has_more": false,
                            "object": "list",
                            "total_count": 1,
                            "url": "/v1/subscription_items?subscription=sub_1KdBjXLEJyfuWvBBStR9MJFk"
                        },
                        "collection_method_cycle_anchor": null,
                        "id": "sub_1KdBjXLEJyfuWvBBStR9MJFk",
                        "pending_update": null,
                        "default_tax_rates": [],
                        "plan": {
                            "active": false,
                            "aggregate_usage": null,
                            "amount": 400,
                            "amount_decimal": "400",
                            "billing_scheme": "per_unit",
                            "created": 1647255999,
                            "currency": "eur",
                            "deleted": null,
                            "id": "price_1KdBjXLEJyfuWvBB0IGwvYP3",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {},
                            "name": null,
                            "nickname": null,
                            "object": "plan",
                            "product": "prod_JjiIPD7pifRJMk",
                            "tiers": null,
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        }
                    },
                    "subscriptionId": "sub_1KdBjXLEJyfuWvBBStR9MJFk"
                },
                "provider": "stripe",
                "subscriptionId": "sub_1KdBjXLEJyfuWvBBStR9MJFk",
                "subscriptionPlan": {
                    "active": false,
                    "aggregate_usage": null,
                    "amount": 400,
                    "amount_decimal": "400",
                    "billing_scheme": "per_unit",
                    "created": 1647255999,
                    "currency": "eur",
                    "deleted": null,
                    "id": "price_1KdBjXLEJyfuWvBB0IGwvYP3",
                    "interval": "month",
                    "interval_count": 1,
                    "livemode": false,
                    "metadata": {},
                    "name": null,
                    "nickname": null,
                    "object": "plan",
                    "product": "prod_JjiIPD7pifRJMk",
                    "tiers": null,
                    "tiers_mode": null,
                    "transform_usage": null,
                    "trial_period_days": null,
                    "usage_type": "licensed"
                }
            }
        },
        "testing": false
    },
    "actionId": 331,
    "actionPage": {
        "locale": "fr",
        "name": "birds/minimumbasicseeds",
        "supporterConfirmTemplate": null,
        "thankYouTemplate": "3568892",
        "thankYouTemplateRef": null
    },
    "actionPageId": 1,
    "campaign": {
        "externalId": null,
        "name": "letsdoit",
        "title": "Let's do it!"
    },
    "campaignId": 1,
    "contact": {
        "area": "PL",
        "contactRef": "DPoA1I3I2UAxOpimtHo_IOuzkb8Yjyb8ImK-iqA0px8",
        "country": "PL",
        "email": "aaronelliotross+wifezit@gmail.com",
        "firstName": "Gay",
        "lastName": "Emerson",
        "postcode": "88 LL CC"
    },
    "org": {
        "name": "WeMove",
        "title": "WeMove"
    },
    "orgId": 2,
    "personalInfo": null,
    "privacy": {
        "emailStatus": null,
        "emailStatusChanged": null,
        "givenAt": "2022-03-14T11:06:44Z",
        "optIn": false,
        "withConsent": true
    },
    "schema": "proca:action:2",
    "stage": "deliver",
    "tracking": {
        "campaign": "unknown",
        "content": "",
        "location": "https://act.not-a2.eu/campaigns/2022-spring-fundraising-update",
        "medium": "unknown",
        "source": "unknown"
    }
}