tests/proca-messages/stripe-monthly-payment.json

{
    "id": "evt_1KefKqLEJyfuWvBBlgGiyC56",
    "object": "event",
    "api_version": "2020-03-02",
    "created": 1647608115,
    "data": {
        "object": {
            "id": "in_1KefKnLEJyfuWvBBbTfYKt4u",
            "object": "invoice",
            "account_country": "DE",
            "account_name": "WeMove Europe SCE mbH",
            "account_tax_ids": null,
            "amount_due": 400,
            "amount_paid": 400,
            "amount_remaining": 0,
            "application_fee_amount": null,
            "attempt_count": 1,
            "attempted": true,
            "auto_advance": false,
            "automatic_tax": {
                "enabled": false,
                "status": null
            },
            "billing_reason": "subscription_update",
            "charge": "ch_3KefKnLEJyfuWvBB1kgvqBsA",
            "collection_method": "charge_automatically",
            "created": 1647608113,
            "currency": "eur",
            "custom_fields": null,
            "customer": "cus_LLM1Z6ETkStTib",
            "customer_address": {
                "city": null,
                "country": "SI",
                "line1": null,
                "line2": null,
                "postal_code": "11111",
                "state": null
            },
            "customer_email": "aaronelliotross+mevuvamyl@gmail.com",
            "customer_name": "Violet Pierce",
            "customer_phone": null,
            "customer_shipping": null,
            "customer_tax_exempt": "none",
            "customer_tax_ids": [],
            "default_payment_method": null,
            "default_source": null,
            "default_tax_rates": [],
            "description": null,
            "discount": null,
            "discounts": [],
            "due_date": null,
            "ending_balance": 0,
            "footer": null,
            "hosted_invoice_url": "https://invoice.stripe.com/i/acct_16ExxKLEJyfuWvBB/test_YWNjdF8xNkV4eEtMRUp5ZnVXdkJCLF9MTE0yZ25iRUtpQlNmQkM1MHpHbmtwQk1IS1VKaWNYLDM4MTQ4OTE20200fz2sqfEB?s=ap",
            "invoice_pdf": "https://pay.stripe.com/invoice/acct_16ExxKLEJyfuWvBB/test_YWNjdF8xNkV4eEtMRUp5ZnVXdkJCLF9MTE0yZ25iRUtpQlNmQkM1MHpHbmtwQk1IS1VKaWNYLDM4MTQ4OTE20200fz2sqfEB/pdf?s=ap",
            "last_finalization_error": null,
            "lines": {
                "object": "list",
                "data": [
                    {
                        "id": "il_1KefKnLEJyfuWvBBIEhnBQ76",
                        "object": "line_item",
                        "amount": 400,
                        "currency": "eur",
                        "description": "1 × WeMove Donation (at €4.00 / month)",
                        "discount_amounts": [],
                        "discountable": true,
                        "discounts": [],
                        "livemode": false,
                        "metadata": {
                            "amount": "4",
                            "campaign": "1339",
                            "country": "SI",
                            "email": "aaronelliotross+mevuvamyl@gmail.com",
                            "firstname": "Violet",
                            "frequency": "monthly",
                            "initialAmount": "8",
                            "language": "en",
                            "lastname": "Pierce",
                            "paymentMethod": "stripe",
                            "postcode": "11111",
                            "speakoutCampaign": "1339"
                        },
                        "period": {
                            "end": 1650286512,
                            "start": 1647608112
                        },
                        "plan": {
                            "id": "price_1KefJwLEJyfuWvBBd4ng2yOi",
                            "object": "plan",
                            "active": false,
                            "aggregate_usage": null,
                            "amount": 400,
                            "amount_decimal": "400",
                            "billing_scheme": "per_unit",
                            "created": 1647608060,
                            "currency": "eur",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_JjiIPD7pifRJMk",
                            "tiers": null,
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "price": {
                            "id": "price_1KefJwLEJyfuWvBBd4ng2yOi",
                            "object": "price",
                            "active": false,
                            "billing_scheme": "per_unit",
                            "created": 1647608060,
                            "currency": "eur",
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_JjiIPD7pifRJMk",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "month",
                                "interval_count": 1,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "tax_behavior": "unspecified",
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": 400,
                            "unit_amount_decimal": "400"
                        },
                        "proration": false,
                        "proration_details": {
                            "credited_items": null
                        },
                        "quantity": 1,
                        "subscription": "sub_1KefJwLEJyfuWvBBnob8Vrwr",
                        "subscription_item": "si_LLM28GJKT872lQ",
                        "tax_amounts": [],
                        "tax_rates": [],
                        "type": "subscription"
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/invoices/in_1KefKnLEJyfuWvBBbTfYKt4u/lines"
            },
            "livemode": false,
            "metadata": {},
            "next_payment_attempt": null,
            "number": "1BAC7098-0002",
            "on_behalf_of": null,
            "paid": true,
            "paid_out_of_band": false,
            "payment_intent": "pi_3KefKnLEJyfuWvBB1cFvP7u3",
            "payment_settings": {
                "payment_method_options": null,
                "payment_method_types": null
            },
            "period_end": 1647608112,
            "period_start": 1647608112,
            "post_payment_credit_notes_amount": 0,
            "pre_payment_credit_notes_amount": 0,
            "quote": null,
            "receipt_number": null,
            "starting_balance": 0,
            "statement_descriptor": null,
            "status": "paid",
            "status_transitions": {
                "finalized_at": 1647608113,
                "marked_uncollectible_at": null,
                "paid_at": 1647608112,
                "voided_at": null
            },
            "subscription": "sub_1KdBjXLEJyfuWvBBStR9MJFk",
            "subtotal": 400,
            "tax": null,
            "tax_percent": null,
            "test_clock": null,
            "total": 400,
            "total_discount_amounts": [],
            "total_tax_amounts": [],
            "transfer_data": null,
            "webhooks_delivered_at": 1647608113
        }
    },
    "livemode": false,
    "pending_webhooks": 1,
    "request": {
        "id": "req_hcqErWHRQZpR8T",
        "idempotency_key": "f6990b78-4bab-4412-88f4-5f41a19efb3c"
    },
    "type": "invoice.payment_succeeded"
}