tests/proca-messages/stripe-weekly.json

{
    "action": {
        "actionType": "donate",
        "createdAt": "2022-04-12T08:35:47Z",
        "customFields": {
            "amount": 7,
            "frequency": "monthly",
            "initialAmount": 5,
            "isWeekly": true,
            "paymentMethod": "stripe",
            "weeklyAmount": 7
        },
        "donation": {
            "amount": 3010,
            "currency": "EUR",
            "frequencyUnit": "monthly",
            "payload": {
                "customerId": "cus_LUeVzxYspb1nZZ",
                "formValues": {
                    "country": "RO",
                    "email": "aaronelliotross+gizivo@gmail.com",
                    "firstname": "Rhea",
                    "lastname": "Wolf",
                    "postcode": "ZZ 2341"
                },
                "paymentConfirm": {
                    "amount": 3010,
                    "automatic_payment_methods": null,
                    "canceled_at": null,
                    "cancellation_reason": null,
                    "capture_method": "automatic",
                    "client_secret": "pi_3KnfCNLEJyfuWvBB0q6UrhiJ_secret_AnmSnKjVvmEOzYzzGY6oAO1pm",
                    "confirmation_method": "automatic",
                    "created": 1649752543,
                    "currency": "eur",
                    "description": "Subscription creation",
                    "id": "pi_3KnfCNLEJyfuWvBB0q6UrhiJ",
                    "last_payment_error": null,
                    "livemode": false,
                    "next_action": null,
                    "object": "payment_intent",
                    "payment_method": "pm_1KnfCOLEJyfuWvBBAX7Mo5sD",
                    "payment_method_types": [
                        "card",
                        "sepa_debit"
                    ],
                    "processing": null,
                    "receipt_email": null,
                    "setup_future_usage": "off_session",
                    "shipping": null,
                    "source": null,
                    "status": "succeeded"
                },
                "paymentIntent": {
                    "client_secret": "pi_3KnfCNLEJyfuWvBB0q6UrhiJ_secret_AnmSnKjVvmEOzYzzGY6oAO1pm",
                    "response": {
                        "application_fee_percent": null,
                        "livemode": false,
                        "collection_method": "charge_automatically",
                        "default_payment_method": null,
                        "tax_percent": null,
                        "metadata": {
                            "amount": "7",
                            "country": "RO",
                            "email": "aaronelliotross+gizivo@gmail.com",
                            "firstname": "Rhea",
                            "frequency": "weekly",
                            "initialAmount": "5",
                            "isWeekly": "true",
                            "lastname": "Wolf",
                            "location": "http://localhost:3000/",
                            "paymentMethod": "stripe",
                            "postcode": "ZZ 2341",
                            "weeklyAmount": "7"
                        },
                        "pending_setup_intent": null,
                        "discount": null,
                        "start_date": 1649752542,
                        "pause_collection": null,
                        "customer": "cus_LUeVzxYspb1nZZ",
                        "ended_at": null,
                        "days_until_due": null,
                        "pending_invoice_item_interval": null,
                        "billing_thresholds": null,
                        "next_pending_invoice_item_invoice": null,
                        "default_source": null,
                        "cancel_at_period_end": false,
                        "object": "subscription",
                        "billing_cycle_anchor": 1649752542,
                        "schedule": null,
                        "canceled_at": null,
                        "current_period_end": 1652344542,
                        "latest_invoice": {
                            "customer_tax_exempt": "none",
                            "auto_advance": false,
                            "customer_phone": null,
                            "invoice_pdf": "https://pay.stripe.com/invoice/acct_16ExxKLEJyfuWvBB/test_YWNjdF8xNkV4eEtMRUp5ZnVXdkJCLF9MVWVWb25xdVlnbW51V0RUamJmemgwZG1mc2VuejZvLDQwMjkzMzQ00200tNDVJrHU/pdf?s=ap",
                            "starting_balance": 0,
                            "livemode": false,
                            "customer_tax_ids": [],
                            "collection_method": "charge_automatically",
                            "default_payment_method": null,
                            "amount_due": 3010,
                            "attempt_count": 0,
                            "customer_name": "Rhea Wolf",
                            "custom_fields": null,
                            "tax_percent": null,
                            "subtotal": 3010,
                            "account_country": "DE",
                            "metadata": {},
                            "description": null,
                            "paid": false,
                            "pre_payment_credit_notes_amount": 0,
                            "subscription_proration_date": null,
                            "footer": null,
                            "customer_shipping": null,
                            "total": 3010,
                            "payment_intent": {
                                "setup_future_usage": "off_session",
                                "payment_method": null,
                                "livemode": false,
                                "capture_method": "automatic",
                                "payment_method_options": {
                                    "card": {
                                        "installments": null,
                                        "mandate_options": null,
                                        "network": null,
                                        "request_three_d_secure": "automatic"
                                    },
                                    "sepa_debit": {}
                                },
                                "charges": {
                                    "data": [],
                                    "has_more": false,
                                    "object": "list",
                                    "total_count": 0,
                                    "url": "/v1/charges?payment_intent=pi_3KnfCNLEJyfuWvBB0q6UrhiJ"
                                },
                                "amount_received": 0,
                                "metadata": {},
                                "description": "Subscription creation",
                                "payment_method_types": [
                                    "card",
                                    "sepa_debit"
                                ],
                                "amount_capturable": 0,
                                "review": null,
                                "confirmation_method": "automatic",
                                "next_action": null,
                                "on_behalf_of": null,
                                "customer": "cus_LUeVzxYspb1nZZ",
                                "amount": 3010,
                                "invoice": "in_1KnfCMLEJyfuWvBBPCAPON6w",
                                "statement_descriptor": "WeMove Europe",
                                "application": null,
                                "client_secret": "pi_3KnfCNLEJyfuWvBB0q6UrhiJ_secret_AnmSnKjVvmEOzYzzGY6oAO1pm",
                                "receipt_email": null,
                                "object": "payment_intent",
                                "source": null,
                                "last_payment_error": null,
                                "canceled_at": null,
                                "currency": "eur",
                                "created": 1649752543,
                                "cancellation_reason": null,
                                "status": "requires_payment_method",
                                "transfer_group": null,
                                "application_fee_amount": null,
                                "statement_descriptor_suffix": null,
                                "transfer_data": null,
                                "id": "pi_3KnfCNLEJyfuWvBB0q6UrhiJ",
                                "shipping": null
                            },
                            "threshold_reason": null,
                            "discount": null,
                            "customer_email": "aaronelliotross+gizivo@gmail.com",
                            "charge": null,
                            "account_name": "WeMove Europe SCE mbH",
                            "customer": "cus_LUeVzxYspb1nZZ",
                            "amount_paid": 0,
                            "hosted_invoice_url": "https://invoice.stripe.com/i/acct_16ExxKLEJyfuWvBB/test_YWNjdF8xNkV4eEtMRUp5ZnVXdkJCLF9MVWVWb25xdVlnbW51V0RUamJmemgwZG1mc2VuejZvLDQwMjkzMzQ00200tNDVJrHU?s=ap",
                            "statement_descriptor": null,
                            "due_date": null,
                            "default_source": null,
                            "receipt_number": null,
                            "billing_reason": "subscription_create",
                            "object": "invoice",
                            "status_transitions": {
                                "finalized_at": 1649752542,
                                "marked_uncollectible_at": null,
                                "paid_at": null,
                                "voided_at": null
                            },
                            "post_payment_credit_notes_amount": 0,
                            "currency": "eur",
                            "created": 1649752542,
                            "amount_remaining": 3010,
                            "period_end": 1649752542,
                            "next_payment_attempt": null,
                            "subscription": "sub_1KnfCMLEJyfuWvBBx4Rt2EpZ",
                            "webhooks_delivered_at": 1649752542,
                            "total_tax_amounts": [],
                            "deleted": null,
                            "status": "open",
                            "ending_balance": 0,
                            "customer_address": {
                                "city": null,
                                "country": "RO",
                                "line1": null,
                                "line2": null,
                                "postal_code": "ZZ 2341",
                                "state": null
                            },
                            "number": "309D3F2E-0001",
                            "application_fee_amount": null,
                            "tax": null,
                            "period_start": 1649752542,
                            "attempted": false,
                            "id": "in_1KnfCMLEJyfuWvBBPCAPON6w",
                            "default_tax_rates": [],
                            "lines": {
                                "data": [
                                    {
                                        "amount": 3010,
                                        "currency": "eur",
                                        "description": "1 × WeMove Donation (at €30.10 / month)",
                                        "discountable": true,
                                        "id": "il_1KnfCMLEJyfuWvBBXEFVJ9Vy",
                                        "invoice_item": null,
                                        "livemode": false,
                                        "metadata": {
                                            "amount": "7",
                                            "country": "RO",
                                            "email": "aaronelliotross+gizivo@gmail.com",
                                            "firstname": "Rhea",
                                            "frequency": "weekly",
                                            "initialAmount": "5",
                                            "isWeekly": "true",
                                            "lastname": "Wolf",
                                            "location": "http://localhost:3000/",
                                            "paymentMethod": "stripe",
                                            "postcode": "ZZ 2341",
                                            "weeklyAmount": "7"
                                        },
                                        "object": "line_item",
                                        "period": {
                                            "end": 1652344542,
                                            "start": 1649752542
                                        },
                                        "plan": {
                                            "active": false,
                                            "aggregate_usage": null,
                                            "amount": 3010,
                                            "amount_decimal": "3010",
                                            "billing_scheme": "per_unit",
                                            "created": 1649752542,
                                            "currency": "eur",
                                            "deleted": null,
                                            "id": "price_1KnfCMLEJyfuWvBBMO6QHQGg",
                                            "interval": "month",
                                            "interval_count": 1,
                                            "livemode": false,
                                            "metadata": {},
                                            "name": null,
                                            "nickname": null,
                                            "object": "plan",
                                            "product": "prod_JjiIPD7pifRJMk",
                                            "tiers": null,
                                            "tiers_mode": null,
                                            "transform_usage": null,
                                            "trial_period_days": null,
                                            "usage_type": "licensed"
                                        },
                                        "price": {
                                            "active": false,
                                            "amount_decimal": null,
                                            "billing_scheme": "per_unit",
                                            "created": 1649752542,
                                            "currency": "eur",
                                            "id": "price_1KnfCMLEJyfuWvBBMO6QHQGg",
                                            "livemode": false,
                                            "lookup_key": null,
                                            "metadata": {},
                                            "nickname": null,
                                            "object": "price",
                                            "product": "prod_JjiIPD7pifRJMk",
                                            "recurring": {
                                                "aggregate_usage": null,
                                                "interval": "month",
                                                "interval_count": 1,
                                                "trial_period_days": null,
                                                "usage_type": "licensed"
                                            },
                                            "tiers": null,
                                            "tiers_mode": null,
                                            "transform_quantity": null,
                                            "type": "recurring",
                                            "unit_amount": 3010
                                        },
                                        "proration": false,
                                        "quantity": 1,
                                        "subscription": "sub_1KnfCMLEJyfuWvBBx4Rt2EpZ",
                                        "subscription_item": "si_LUeV4fIOhUDZ0A",
                                        "tax_amounts": [],
                                        "tax_rates": [],
                                        "type": "subscription"
                                    }
                                ],
                                "has_more": false,
                                "object": "list",
                                "total_count": 1,
                                "url": "/v1/invoices/in_1KnfCMLEJyfuWvBBPCAPON6w/lines"
                            }
                        },
                        "created": 1649752542,
                        "trial_end": null,
                        "cancel_at": null,
                        "trial_start": null,
                        "collection_method_thresholds": null,
                        "current_period_start": 1649752542,
                        "quantity": 1,
                        "status": "incomplete",
                        "items": {
                            "data": [
                                {
                                    "billing_thresholds": null,
                                    "created": 1649752543,
                                    "deleted": null,
                                    "id": "si_LUeV4fIOhUDZ0A",
                                    "metadata": {},
                                    "object": "subscription_item",
                                    "plan": {
                                        "active": false,
                                        "aggregate_usage": null,
                                        "amount": 3010,
                                        "amount_decimal": "3010",
                                        "billing_scheme": "per_unit",
                                        "created": 1649752542,
                                        "currency": "eur",
                                        "deleted": null,
                                        "id": "price_1KnfCMLEJyfuWvBBMO6QHQGg",
                                        "interval": "month",
                                        "interval_count": 1,
                                        "livemode": false,
                                        "metadata": {},
                                        "name": null,
                                        "nickname": null,
                                        "object": "plan",
                                        "product": "prod_JjiIPD7pifRJMk",
                                        "tiers": null,
                                        "tiers_mode": null,
                                        "transform_usage": null,
                                        "trial_period_days": null,
                                        "usage_type": "licensed"
                                    },
                                    "price": {
                                        "active": false,
                                        "amount_decimal": null,
                                        "billing_scheme": "per_unit",
                                        "created": 1649752542,
                                        "currency": "eur",
                                        "id": "price_1KnfCMLEJyfuWvBBMO6QHQGg",
                                        "livemode": false,
                                        "lookup_key": null,
                                        "metadata": {},
                                        "nickname": null,
                                        "object": "price",
                                        "product": "prod_JjiIPD7pifRJMk",
                                        "recurring": {
                                            "aggregate_usage": null,
                                            "interval": "month",
                                            "interval_count": 1,
                                            "trial_period_days": null,
                                            "usage_type": "licensed"
                                        },
                                        "tiers": null,
                                        "tiers_mode": null,
                                        "transform_quantity": null,
                                        "type": "recurring",
                                        "unit_amount": 3010
                                    },
                                    "quantity": 1,
                                    "subscription": "sub_1KnfCMLEJyfuWvBBx4Rt2EpZ",
                                    "tax_rates": []
                                }
                            ],
                            "has_more": false,
                            "object": "list",
                            "total_count": 1,
                            "url": "/v1/subscription_items?subscription=sub_1KnfCMLEJyfuWvBBx4Rt2EpZ"
                        },
                        "collection_method_cycle_anchor": null,
                        "id": "sub_1KnfCMLEJyfuWvBBx4Rt2EpZ",
                        "pending_update": null,
                        "default_tax_rates": [],
                        "plan": {
                            "active": false,
                            "aggregate_usage": null,
                            "amount": 3010,
                            "amount_decimal": "3010",
                            "billing_scheme": "per_unit",
                            "created": 1649752542,
                            "currency": "eur",
                            "deleted": null,
                            "id": "price_1KnfCMLEJyfuWvBBMO6QHQGg",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {},
                            "name": null,
                            "nickname": null,
                            "object": "plan",
                            "product": "prod_JjiIPD7pifRJMk",
                            "tiers": null,
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        }
                    },
                    "subscriptionId": "sub_1KnfCMLEJyfuWvBBx4Rt2EpZ"
                },
                "provider": "stripe",
                "subscriptionId": "sub_1KnfCMLEJyfuWvBBx4Rt2EpZ",
                "subscriptionPlan": {
                    "active": false,
                    "aggregate_usage": null,
                    "amount": 3010,
                    "amount_decimal": "3010",
                    "billing_scheme": "per_unit",
                    "created": 1649752542,
                    "currency": "eur",
                    "deleted": null,
                    "id": "price_1KnfCMLEJyfuWvBBMO6QHQGg",
                    "interval": "month",
                    "interval_count": 1,
                    "livemode": false,
                    "metadata": {},
                    "name": null,
                    "nickname": null,
                    "object": "plan",
                    "product": "prod_JjiIPD7pifRJMk",
                    "tiers": null,
                    "tiers_mode": null,
                    "transform_usage": null,
                    "trial_period_days": null,
                    "usage_type": "licensed"
                }
            }
        },
        "testing": false
    },
    "actionId": 389,
    "actionPage": {
        "locale": "en",
        "name": "birds/minimumbasicseeds",
        "supporterConfirmTemplate": null,
        "thankYouTemplate": "3568892",
        "thankYouTemplateRef": null
    },
    "actionPageId": 1,
    "campaign": {
        "externalId": null,
        "name": "seeds",
        "title": "Seeds"
    },
    "campaignId": 1,
    "contact": {
        "area": "RO",
        "contactRef": "P9xc6OSwFYrRINLM3e-NLKSi5iWUwXNOJ7AxaoPt8hE",
        "country": "RO",
        "email": "aaronelliotross+gizivo@gmail.com",
        "firstName": "Rhea",
        "lastName": "Wolf",
        "postcode": "ZZ 2341"
    },
    "org": {
        "name": "birdsbirdsbirds",
        "title": "Birds Birds Birds"
    },
    "orgId": 2,
    "personalInfo": null,
    "privacy": {
        "emailStatus": null,
        "emailStatusChanged": null,
        "givenAt": "2022-04-12T08:35:47Z",
        "optIn": false,
        "withConsent": true
    },
    "schema": "proca:action:2",
    "stage": "deliver",
    "tracking": {
        "campaign": "unknown",
        "content": "",
        "location": "http://localhost:3000/",
        "medium": "unknown",
        "source": "unknown"
    }
}